### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
import pandas
list1= [11, 22, 'sambit', 'roll-4', 5, 6, 7, 8, 12.90, 100]

series = pandas.Series(list1)
print(series)

0        11
1        22
2    sambit
3    roll-4
4         5
5         6
6         7
7         8
8      12.9
9       100
dtype: object

### Q3. Create a Pandas DataFrame that contains the following data: and Then, print the DataFrame.

In [3]:
import pandas as pd

In [4]:
DF= pd.DataFrame({'Name':['Alice','Bob','Claire'],
                  'Age':[25,30,27],
                  'Gender':['Female','Male','Female']
                 })

In [5]:
DF

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure that consists of rows and columns. It can be thought of as a table or spreadsheet-like data structure where each column can have a different data type and is labeled with a column name.

On the other hand, a Series is a one-dimensional labeled array that can store any data type. It can be considered as a single column of a DataFrame.

In [6]:
# Creating a DataFrame
Data= pd.DataFrame({'Name':['Alice','Bob','Claire'],
                  'Age':[25,30,27],
                  'Gender':['Female','Male','Female'],
                    'city':['London','Delhi','Kathmandu']
                 })

In [7]:
Data

     Name  Age  Gender       city
0   Alice   25  Female     London
1     Bob   30    Male      Delhi
2  Claire   27  Female  Kathmandu

In [8]:
# Creating a Series
list2= ['Sambit',5.8,64,'Data science master 2.0','Bunty','NIQ', 3.6]

series = pd.Series(list2)
print(series)

0                     Sambit
1                        5.8
2                         64
3    Data science master 2.0
4                      Bunty
5                        NIQ
6                        3.6
dtype: object

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas provides much number of functions to manipulate data in a DataFrame. Here are some common functions we can use:
head() and tail(), describe(), info(), sort_values(), groupby(), drop(), fillna(), iloc(), loc(), transpose(), sort_index() etc.

In [9]:
#Examples

Data.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [10]:
Data.transpose()

             0      1          2
Name     Alice    Bob     Claire
Age         25     30         27
Gender  Female   Male     Female
city    London  Delhi  Kathmandu

In [11]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
 3   city    3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Among the options mentioned above Series and DataFrame are mutable in nature that means Series objects can modify their values, add or remove elements, and update their indices. And same as DataFrame objects can modify the values in the cells, add or remove columns or rows, and update the indices and column names.

But in the other hand 'Panel' are not mutable in nature and so on in the recent version of Pandas Panel no longer used.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

We can use the pd.concat() function to merge many Series into one DataFrame or We can send them as a dictionary to the pd.DataFrame() constructor.

In [12]:
# Example - Using pd.concat()

import pandas as pd
series1 = pd.Series([1, 2, 3, 4, 5])
series2 = pd.Series(['A', 'B', 'C', 'D', 'E'])

Data1 = pd.concat([series1, series2], axis=1)

In [13]:
Data1

   0  1
0  1  A
1  2  B
2  3  C
3  4  D
4  5  E

In [14]:
# Example - Using pd.DataFrame()

Data2= pd.DataFrame({'Name':['Alice','Bob','Claire'],
                  'Age':[25,30,27],
                  'Gender':['Female','Male','Female'],
                    'city':['London','Delhi','Kathmandu'],
                     'Country':['UK','India','Nepal'],
                     'Net_worth':[20005000,300000000,45000000]
                 })

In [15]:
Data2

     Name  Age  Gender       city Country  Net_worth
0   Alice   25  Female     London      UK   20005000
1     Bob   30    Male      Delhi   India  300000000
2  Claire   27  Female  Kathmandu   Nepal   45000000